import requests
import time

IP_ADDR = "157.245.54.111:5000"

meow = [
"+79884653244",
"+79100092638",
"+79057504660",
"+79776778130",
"+79167891660",
"+79647829297",
"+79174380545",
"+79263535995",
"+79267137068",
"+79165890133",
"+79150239221",
"+79101723618",
"+79060888738",
"+79670604640",
"+79530125065",
"+79138180707",
"+79197278993",
"+79191228822",
"+79857880100",
"+79661112035",
"+79063850012",
"+79999830024",
"+79152494556",
"+79615447737",
"+79067045692"]

def add_number(number, group):
    print(number, group)
    print("[Добавление пользователя в систему]")
    r = requests.post("http://"+IP_ADDR+"/add_number", data={"number": number, "group": group})
    print(r.text)

for phone in meow:
    add_number(phone,"ПИ19-1")
    time.sleep(1)